app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "device_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["device_token", "eyJhbGciOiJIUzI1NiJ9.eyJpZCI6MSwiZXhwIjoxNTkyOTA4MzYzfQ.ZqTbaBnRwsYSY8JxbvVU64Pt8npo2qQgcovOfPuPTd8"], ["updated_at", "2020-04-24 10:32:43.445006"], ["id", 1]]
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    user = User.find_by_email(params[:email])
    if user && user.valid_password?(params[:password])
      user.update(device_token: user.generate_jwt)
      data = {id: user.id, email: user.email, name: user.full_name, gender: user.gender, phone_number: user.phone_number, organization: (user.organization_name if user.organization.present?), token: user.generate_jwt}

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "device_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["device_token", nil], ["updated_at", "2020-04-24 10:33:58.988109"], ["id", 1]]
---
  def destroy
    if !request.headers['Authorization'].present?
      json_response(:unprocessable_entity, 422, "Authorization token must exsist!", "")
    else
      if params[:user][:user_id]
        user = User.find_by_id(params[:user][:user_id])
        if user.present?
          JwtBlacklist.create({jti: request.headers['Authorization'], exp: Time.now})
          reset_session
          user.update({device_token: nil})