app/controllers/tweets_controller.rb

  def index
    if current_user.admin?
      @tweets = Tweet.all
---
SELECT  "tweets".* FROM "tweets" ORDER BY "tweets"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    if params[:tweet][:message].blank?
      json_response(:not_found, 404, "Please proivde required parameters","")
      return
    end
    tweet = current_user.tweets.new(tweet_params)
    if tweet.save
---
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "new tweet1"], ["user_id", 9], ["created_at", "2020-04-24 11:51:33.589892"], ["updated_at", "2020-04-24 11:51:33.589892"]]

  def update
    if @tweet.present?
      if params[:tweet][:message].blank?
        json_response(:not_found, 404, "Please proivde needed parameters","")
        return
      else
        @tweet.update_attributes(tweet_params)
---
UPDATE "tweets" SET "message" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["message", "New tweet updated a1"], ["updated_at", "2020-04-24 12:25:32.940120"], ["id", 11]]

  def destroy
    if @tweet.present?
      @tweet.destroy
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 19]]

  def check_for_admin
    if current_user.admin?
      @tweet = Tweet.find_by_id(params['id'])
    else
      @tweet = current_user.tweets.find_by_id(params['id'])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 AND "tweets"."id" = $2 LIMIT $3  [["user_id", 13], ["id", 12], ["LIMIT", 1]]